controllers/OrderController.php

    public function actionIndex()
    {
        $user_id = Yii::$app->user->identity->id;
        $user = User::find()->where(['id'=>$user_id])->one();
---
SELECT * FROM `user` WHERE `id`=151