views/html/direct-purchase-order-html.php




$country = LookupCountry::find()->where(['id'=>$list[0]['sellers'][0]['warehouses'][0]['country']])->one();
$state = LookupState::find()->where(['id'=>$list[0]['sellers'][0]['warehouses'][0]['state']])->one();
---
SELECT * FROM `lookup_country` WHERE `id`='1'
SELECT * FROM `lookup_state` WHERE `id`='1'