models/Company.php

SELECT * FROM `user_company` WHERE `user_id`=151
---
    public static function compid()
    {

        $user_id = Yii::$app->user->identity->id;

        $data = UserCompany::find()->where(['user_id'=>$user_id])->one();